src/Catalogs/БЗ_СтатьиБазыЗнаний/БЗ_СтатьиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_СтатьиБазыЗнаний</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеСодержания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.БЗ_ПользователиБазыЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержание</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСворачивание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Картинки</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Граница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Таблицы</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбтеканиеТекста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаСтилейHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстТаблицыHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.БЗ_КатегорииБазыЗнаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сноски</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаТип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаОткрывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаПодсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГиперссылки</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Открывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/БЗ_ПривязкиОбъектов1СКСтатьямБазыЗнаний/БЗ_ПривязкиОбъектов1СКСтатьямБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_ПривязкиОбъектов1СКСтатьямБазыЗнаний</name>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.БЗ_СтатьиБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект1С</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/БЗ_СтатьиБазыЗнаний/Forms/ФормаСписка/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

&НаКлиенте
Процедура УстановитьДоступностьКнопокБлокировки(РедакторСтатьи = Неопределено)
	ДоступностьЗахвата		= Ложь;
	ДоступностьОсвобождения	= Ложь;
	
	Если НЕ ЗначениеЗаполнено(РедакторСтатьи) Тогда
		ДоступностьЗахвата = Истина;
	КонецЕсли;
	Если РедакторСтатьи = ТекущийПользователь ИЛИ РедакторСтатьи = Администратор Тогда
		ДоступностьОсвобождения = Истина;
	КонецЕсли;
	
	Элементы.ЗахватитьНаРедактирование.Доступность		= ДоступностьЗахвата;
	Элементы.МенюЗахватитьНаРедактирование.Доступность	= ДоступностьЗахвата;
	Элементы.ЗавершитьРедактирование.Доступность		= ДоступностьОсвобождения;
	Элементы.МенюЗавершитьРедактирование.Доступность	= ДоступностьОсвобождения;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьКнопокБлокировки(ТекущиеДанные.Редактор);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Администратор		= БЗ_БазаЗнанийВызовСервера.ПолучитьЗначениеНастройки("Администратор");

	//+++ АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
	Если Параметры.Свойство("ИмяОбъекта") Тогда
		ОбъектМетаданных = НайтиОбъектМетаданныхНаСервере(Параметры.ИмяОбъекта);
		пСсылкиНаСтатьи = Новый СписокЗначений;
		
		Если ЗначениеЗаполнено(ОбъектМетаданных) Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	Таб.Статья КАК Статья,
			|	Таб.Объект1С КАК Объект1С
			|ИЗ
			|	РегистрСведений.БЗ_ПривязкиОбъектов1СКСтатьямБазыЗнаний КАК Таб
			|ГДЕ
			|	Таб.Объект1С = &Объект1С");
			
			Запрос.УстановитьПараметр("Объект1С", ОбъектМетаданных);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				пСсылкиНаСтатьи.Добавить(Выборка.Статья);
			КонецЦикла;
			
			Заголовок = "Статьи базы знаний для " + СокрЛП(ОбъектМетаданных);
		КонецЕсли;	
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", пСсылкиНаСтатьи, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	КонецЕсли;
	//--- АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
	
КонецПроцедуры

//+++ АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
Функция НайтиОбъектМетаданныхНаСервере(ИмяОбъекта)
	
	ВозвращаемоеЗначение = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ИмяОбъекта);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
//--- АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗахватитьНаРедактирование(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗахватитьНаРедактированиеНаСервере(ТекущиеДанные.Ссылка);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеАдминистратором(Результат, ДопПараметры)
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьРедактированиеНаСервере(ДопПараметры.Статья);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Статья", ТекущиеДанные.Ссылка);
	Если ЗначениеЗаполнено(ТекущиеДанные.Редактор)
		И ТекущиеДанные.Редактор <> ТекущийПользователь Тогда
		
		Если ТекущийПользователь = Администратор Тогда
			ОбработкаОповещения	= Новый ОписаниеОповещения("ЗавершитьРедактированиеАдминистратором", ЭтотОбъект, ДопПараметры);
			ТекстВопроса		= НСтр("ru='При завершении редактирования администратором возможна потеря данных в параллельных сессиях.
			|Вы уверены что хотите продолжить?'");
			
			ПоказатьВопрос(ОбработкаОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
		Иначе 
			Возврат;
		КонецЕсли;
	Иначе 
		ЗавершитьРедактированиеАдминистратором(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ

&НаСервереБезКонтекста
Функция ЗахватитьНаРедактированиеНаСервере(СтатьяСсылка)
	Возврат Справочники.БЗ_СтатьиБазыЗнаний.ЗахватитьСтатьюНаРедактирование(СтатьяСсылка);
КонецФункции

&НаСервереБезКонтекста
Функция ЗавершитьРедактированиеНаСервере(СтатьяСсылка)
	Возврат Справочники.БЗ_СтатьиБазыЗнаний.ЗавершитьРедактированиеСтатьи(СтатьяСсылка);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ НАСТРОЙКИ ПОРЯДКА ЭЛЕМЕНТОВ

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	//+++ АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(Список, Элементы.Список);
	//--- АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	//+++ АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВнизВыполнить(Список, Элементы.Список);
	//--- АйТи Кучеров Р.М. 07.10.2020 ТЗ № ИС00-003398 >> e1cib/data/Документ.ЗаданиеНаРаботу?ref=82a932336337376211eb089480e29675
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	а = 1;
КонецПроцедуры
